# BuiltInFailures.GridChainSketchFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridChainSketchFailures Class
BuiltInFailures Class Members See Also
---
Failures related to the GridChain sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GridChainSketchFailures
```

Visual Basic
---
```text
Public NotInheritable Class GridChainSketchFailures
```

Visual C++
---
```text
public ref class GridChainSketchFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GridChainSketchFailures
# See Also
BuiltInFailures..::..GridChainSketchFailures Members
Autodesk.Revit.DB Namespace